    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date_wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" 
      TO WW-PUBLISH_DATE_WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
    MOVE "author" TO WW-AUTHOR-VALUE.
    MOVE "title" TO WW-TITLE-VALUE.
    MOVE "genre" TO WW-GENRE-VALUE.
    MOVE "price" TO WW-PRICE-VALUE.
    MOVE "publish_date" TO WW-PUBLISH_DATE-VALUE.
    MOVE "description" TO WW-DESCRIPTION-VALUE.
