MOVE XXXXXxxxxxxxxxxxxxxxxxxxxxx TO WW-NAME-VALUE.
MOVE YYYYYtttttttttttt TO WW-LINE1-VALUE.
MOVE ZZZZZQQQQQQQQQQ TO WW-LINE2-VALUE.
MOVE AAAAA TO WW-CITY-VALUE.
MOVE 995555555555599 TO WW-PHONE-VALUE.
